class GenresController < ApplicationController
  # Метод для отображения списка жанров
  def index
    # Здесь вы можете добавить код для отображения списка всех доступных жанров
  end

  # Метод для отображения формы создания нового жанра
  def new
    # Здесь вы можете добавить код для отображения формы создания нового жанра
  end

  # Метод для создания нового жанра
  def create
    # Здесь вы можете добавить код для обработки данных, отправленных из формы создания жанра
  end

  # Метод для удаления жанра
  def destroy
    # Здесь вы можете добавить код для удаления выбранного жанра
  end

  # Метод для отображения формы редактирования жанра
  def edit
    # Здесь вы можете добавить код для отображения формы редактирования существующего жанра
  end
end
